brew "cask"
brew "stow"
brew "starship"
brew 'mongodb'
brew 'mysql'
brew 'redis', restart_service: true
brew "git"
brew "curl"
brew "nvim"
brew "tmux"
brew "zsh"
brew "jq"
brew "rbenv"
brew "mas"
brew "nvm"
brew "node"
brew "nodebrew"
brew "npm"
brew "composer"
brew "pyenv"
brew "postgresql"
brew "deno"
brew "yarn"
brew "docker"
brew "protobuf"
brew "grpc"
brew "awscli"
brew "tfenv"
brew "grep"
brew "neovim"
brew "telnet"
brew "xxhash"
brew "openssl"
brew "cmake"
brew "minikube"
brew "alp"
brew "hyperkit"
brew "helm"
brew "go"
brew "pulumi"
brew "wget"
brew "cfssl"
brew "kind"
brew "hping"
brew "kn"
brew "vitess"
brew "knative-sandbox/kn-plugins/quickstart"
brew "skaffold"
brew "etcd"
brew "jump"

# brew "fzf"
# brew "asdf"
# brew "applesimutils"
# brew "bandwhich"
# brew "bat"
# brew "cocoapods"
# brew "coreutils"
# brew "dust"
# brew "ethereum"
# brew "exa"
# brew "fd"
# brew "fzf"
# brew "gh"
# brew "git-delta"

# brew "htop"
# brew "hyperfine"
# brew "ios-deploy"
# brew "lf"
# brew "ncdu"
# brew "nushell"
# brew "procs"
# brew "ripgrep"
# brew "rust-analyzer"
# brew "sd"
# brew "sk"
# brew "skhd"
# brew "starship"
# brew "stow"
# brew "tealdeer"
# brew "terminal-notifier"
# brew "tokei"
# brew "watchman"
# brew "yabai"
# brew "ytop"
# brew "zola"
# brew "zoxide"
# brew "zsh-autosuggestions"
# brew "gist"
# brew 'emacs', args: ['with-cocoa', 'with-gnutls']
# brew 'sphinx'
# brew 'imagemagick'

cask "docker"
cask "insomnia"
cask "skype"
cask "slack"
cask "notion"
cask "android-studio"
cask "brave-browser"
cask "discord"
cask "docker"
cask "google-chrome"
cask "github"
cask "google-cloud-sdk"
cask "virtualbox" if system '[ "$(uname -m)" = "x86_64" ]'
cask "visual-studio-code"
cask "zoom"
cask "miniconda"
cask "chromedriver"
cask "clipy"
cask 'firefox', args: { appdir: '/Applications' }
cask "google-japanese-ime"
cask "iterm2"
cask "kindle"
cask "cyberduck"
cask "mysqlworkbench"
cask "spotify"
cask "sourcetree"
cask "telegram"
cask "messenger"
cask "1password"
cask "alfred"
cask "pgadmin4"
cask 'mongodb-compass'
cask 'launchcontrol'
# cask "alacritty"
# cask "android-file-transfer"
# cask "bitwarden"
# cask "figma"
# cask "font-hack-nerd-font"
# cask "gpg-suite"
# cask "hammerspoon"
# cask "iina"
# cask "ledger-live"
# cask "minecraft"
# cask "obs"
# cask "obs-ndi"
# cask "react-native-debugger"
# cask "semulov"
# cask "signal"
# cask "soundflower" if system '[ "$(uname -m)" = "x86_64" ]'
# cask "steam"
# cask 'java' unless system '/usr/libexec/java_home --failfast'
# cask_args appdir: '/Applications'

mas "com.apple.dt.Xcode", id: 497799835
mas "com.zoho.cliq", id: 1205882554
mas "line", id: 539883307
# mas "Final Cut Pro", id: 424389933
# mas "Simple Recorder-Voice Recorder", id: 989175722

tap "heroku/brew"
tap "homebrew/services"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "mongodb/brew"
tap "grpc/grpc"

# tap 'caskroom/cask'
# tap 'telemachus/brew', 'https://telemachus@bitbucket.org/telemachus/brew.'
# tap "cjbassi/ytop"
# tap "ethereum/ethereum"
# tap "extrawurst/tap"
# tap "github/gh"
# tap "homebrew/cask-fonts"
# tap "koekeishiya/formulae"
# tap "wix/brew"
# cask_args appdir: "/Applications"
